
#+begin_src j :session :exports results
load 'manifest.ijs'
];._2 DESCRIPTION
#+end_src

#+RESULTS:
: bootstrapping benchmarks in J for confidence                                                                        
:                                                                                                                     
: inspired by https://hackage.haskell.org/package/criterion                                                           
:                                                                                                                     
: informed by https://projecteuclid.org/download/pdf_1/euclid.ss/1177013815 and https://web.stanford.edu/~hastie/CASI/

* Example

#+begin_src j :session :exports both :sit 1
load 'bonsai.ijs'

NB. benchmark generating and inverting 200x200 random matrix entries
NB. in [0,1]
bonsai '%. ? 200 200 $ 0'
#+end_src

#+RESULTS:
#+begin_example
┌───────┬──────────┬──────────┬───────────┐
│N = 342│lower     │estimate  │upper      │
├───────┼──────────┼──────────┼───────────┤
│ols    │0.00151567│0.00152333│0.00153499 │
├───────┼──────────┼──────────┼───────────┤
│R^2    │0.999963  │0.999993  │0.999998   │
├───────┼──────────┼──────────┼───────────┤
│mean   │0.00151631│0.00152347│0.00153401 │
├───────┼──────────┼──────────┼───────────┤
│stddev │4.25677e_5│7.77916e_5│0.000120104│
└───────┴──────────┴──────────┴───────────┘
#+end_example
